#+TITLE: D-Hadronic Analysis Progress - 11.4

** DONE Understand the asymmetry of yields (281ipbv12)
   
   Check the yields in Generic MC:

   | Mode   |      D |   Dbar | Diff (%) |
   |--------+--------+--------+----------|
   | Kpipi0 | 973050 | 980784 |     0.79 |
   | Kpipi  | 836152 | 846878 |     1.28 |
   #+TBLFM: $4=($3-$2)*100/$2;%.2f

   Check yields in data 281/pb: 

   | Mode   |     D |  Dbar | Diff (%) |
   |--------+-------+-------+----------|
   | Kpipi0 | 50276 | 50537 |     0.52 |
   | Kpipi  | 40248 | 40734 |     1.21 |
   #+TBLFM: $4=($3-$2)*100/$2;%.2f
   
   Very close to the generic MC. So, the asymmetry should not be the
   reason. 

   Document on mtg page ... done. 

   

   



   
*** DONE Multipion background 
    
    Select Kssideband (eliminate mBC out of range events)

    : dhad-11.4 sel kssideband signal Single_Dp_to_Kspi 818ipbv12 -s interact -t OK. 
    : dhad-11.4 sel kssideband signal Single_Dp_to_Kspi 818ipbv12 -t OK. 
    : dhad-11.4 sel kssideband signal single_ks 818ipbv12 ... done. 

    : dhad-11.4 sel kssideband data Single_Dp_to_Kspi 818ipbv12 -s interact -t OK. 
    : dhad-11.4 sel kssideband data Single_Dp_to_Kspi 818ipbv12 -t OK. 
    : dhad-11.4 sel kssideband data single_ks 818ipbv12 ... done. 

    : dhad-11.4 sel kssideband generic Single_Dp_to_Kspi 818ipbv12 -s interact -t OK
    : dhad-11.4 sel kssideband generic single_ks 818ipbv12 ... done. 


    Fit Kssideband:

    : dhad-11.4 fit signal Single_Dp_to_Kspi 818ipbv12/kssideband -s interact OK. 
    : dhad-11.4 fit signal Single_Dp_to_Kspi 818ipbv12/kssideband -t OK. 
    : dhad-11.4 fit signal single_ks_p 818ipbv12/kssideband ... done. 
    : dhad-11.4 fig signal single_ks_p 818ipbv12/kssideband OK. 

    : dhad-11.4 fit data Single_Dp_to_Kspi 818ipbv12/kssideband -s interact -t OK. 
    : dhad-11.4 fit data single_ks_p 818ipbv12/kssideband ... done. 
    : dhad-11.4 fig data single_ks_p 818ipbv12/kssideband OK. 


    : dhad-11.4 fit generic Single_Dp_to_Kspi 818ipbv12/kssideband -s interact -t OK. 
    : dhad-11.4 fit generic single_ks_p 818ipbv12/kssideband ... done.  
    : dhad-11.4 fig generic single_ks_p 818ipbv12/kssideband OK. 

    Create Efficiency table: 

    : dhad-11.4 tab cbx kssidebandeff 818ipbv12 OK. 

    Update the table in CBX... done. 

    Fit the Ks sideband with fixed sigmap1 using diag double tag fits.

    : dhad-11.4 fit signal Single_Dp_to_Kspi 818ipbv12/kssideband/fix_sigmap1 -s interact -t OK. 
    
    Only fit for data:
    : dhad-11.4 fit data Single_Dp_to_Kspi 818ipbv12/kssideband/fix_sigmap1 -s interact -t OK. 

    : dhad-11.4 fit data single_ks_p 818ipbv12/kssideband/fix_sigmap1 ... done. 
    : dhad-11.4 fig data single_ks_p 818ipbv12/kssideband/fix_sigmap1 OK. 
    
    Compare the yields with previous:

    | Mode        | 818/pb (old) |  New | Diff (%) |
    |-------------+--------------+------+----------|
    | Ks pi       |          495 |  482 |     -2.6 |
    | Ks pi pi0   |         2072 | 1965 |     -5.2 |
    | Ks pi pi pi |         2438 | 2369 |     -2.8 |
    #+TBLFM: $4=($3-$2)*100/$2;%.1f

    Previous consistency check:

    | Mode        | 281/pb | 281/pb * 2.91 | 818/pb (old) | Delta (%) |
    |-------------+--------+---------------+--------------+-----------|
    | Ks pi       |    183 |        532.53 |          495 |     -7.05 |
    | Ks pi pi0   |    686 |       1996.26 |         2072 |      3.79 |
    | Ks pi pi pi |    863 |       2511.33 |         2438 |     -2.92 |
    #+TBLFM: $3=$2*2.91::$5=($4-$3)*100/$3;%.2f

    | Mode        | 281/pb | 281/pb * 2.91 | 818/pb (new) | Delta (%) |
    |-------------+--------+---------------+--------------+-----------|
    | Ks pi       |    183 |        532.53 |          482 |     -9.49 |
    | Ks pi pi0   |    686 |       1996.26 |         1965 |     -1.57 |
    | Ks pi pi pi |    863 |       2511.33 |         2369 |     -5.67 |
    #+TBLFM: $3=$2*2.91::$5=($4-$3)*100/$3;%.2f

    Close to previous. 
    
    Update the bkg table: 

    : dhad-11.4 tab cbx singletag_sigmc_eff 818ipbv12 

    : dhad-11.4 tab cbx extlabsbkg 818ipbv12 ... OK. 

    Generic MC truth:

     3031
     6958
     13712

     

